# macOS Starter Brewfile
# Install with: brew bundle install --file=Brewfile

# Taps
# Note: homebrew/cask-fonts is deprecated since Homebrew 4.0, fonts are now in main cask tap
tap "homebrew/services"
tap "danielfoehrkn/switch"  # kubeswitch

# =====================
# CLI Tools
# =====================

# Version Control
brew "git"
brew "gh"
brew "delta"     # Better git diff

# Shell
brew "zsh"
brew "starship"

# Modern CLI replacements
brew "eza"       # ls replacement
brew "bat"       # cat replacement
brew "fd"        # find replacement
brew "ripgrep"   # grep replacement
brew "sd"        # sed replacement
brew "dust"      # du replacement
brew "procs"     # ps replacement
brew "bottom"    # top replacement

# File tools
brew "tree"
brew "wget"
brew "curl"
brew "jq"
brew "yq"

# =====================
# Languages
# =====================

# Node.js
brew "fnm"

# Python (uv manages Python versions)
brew "uv"

# Go
brew "goenv"
brew "go"

# =====================
# Container & Kubernetes
# =====================

# Kubernetes CLI
brew "kubectl"
brew "helm"
brew "k9s"                              # K8s TUI
brew "danielfoehrkn/switch/switch"      # kubeswitch (context 切换)
brew "stern"                            # Multi-pod log tailing

# =====================
# Cloud & Platform CLI
# =====================

# Cloud Providers
brew "awscli"                           # AWS
# brew "google-cloud-sdk"               # GCP (大，按需安装)
# brew "azure-cli"                      # Azure (按需安装)

# Deployment Platforms
# brew "vercel-cli"                     # Vercel (推荐用 pnpm 安装)
# brew "cloudflare-wrangler2"           # Cloudflare Workers

# Storage
brew "rclone"                           # 通用云存储 CLI

# =====================
# Code Quality
# =====================

brew "golangci-lint"
brew "shellcheck"

# =====================
# Cask Applications
# =====================

# ===== 必装 =====
cask "raycast"              # Spotlight + 窗口管理
cask "1password"            # 密码管理
cask "google-chrome"        # 浏览器
cask "keepingyouawake"      # 防休眠
cask "keka"                 # 解压缩
cask "appcleaner"           # 应用卸载

# ===== 开发工具 =====
cask "cursor"               # AI 编辑器 (主力)
cask "visual-studio-code"   # 备用编辑器
cask "warp"                 # AI 终端
cask "orbstack"             # Docker/K8s
cask "apifox"               # API 开发
cask "proxyman"             # HTTP 调试
cask "sourcetree"           # Git GUI
cask "jetbrains-toolbox"    # JetBrains IDE

# ===== 设计 & 媒体 =====
cask "iina"                 # 视频播放
cask "imageoptim"           # 图片压缩
cask "eagle"                # 素材管理

# ===== 工作 & 协作 =====
cask "lark"                 # 飞书
cask "dingtalk"             # 钉钉
cask "wecom"                # 企业微信
cask "wechat"               # 微信
cask "discord"              # 社区
cask "whatsapp"             # 国际通讯
cask "tencent-meeting"      # 腾讯会议
cask "notion"               # 笔记

# ===== AI 工具 =====
cask "lm-studio"            # 本地大模型

# ===== 系统增强 =====
cask "istat-menus"          # 系统监控
cask "coconutbattery"       # 电池监控
cask "monitorcontrol"       # 外接显示器亮度
cask "gas-mask"             # Hosts 管理
cask "balenaetcher"         # 启动盘制作
cask "openinterminal-lite"  # Finder 打开终端
cask "qlmarkdown"           # Markdown 预览
cask "syntax-highlight"     # 代码预览

# ===== 其他 =====
cask "neteasemusic"         # 网易云音乐

# =====================
# Fonts
# =====================

cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-inter"
cask "font-noto-sans-cjk-sc"
