# =============================================================================
# Brewfile - macOS Starter
# https://github.com/larrykoo711/new-macos-starter
# =============================================================================
# Usage: brew bundle install --file=scripts/Brewfile
# =============================================================================

# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "danielfoehrkn/switch"

# =============================================================================
# CLI Tools - Development
# =============================================================================

# Version Control
brew "git"
brew "gh"
brew "delta"

# Shell Enhancement
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "autojump"
brew "fzf"                    # Fuzzy finder

# Modern CLI Replacements
brew "eza"                    # Better ls
brew "bat"                    # Better cat
brew "fd"                     # Better find
brew "ripgrep"                # Better grep
brew "sd"                     # Better sed
brew "dust"                   # Better du
brew "procs"                  # Better ps
brew "bottom"                 # Better top

# File & Text Processing
brew "tree"
brew "jq"
brew "yq"

# Network
brew "curl"
brew "wget"

# Code Quality
brew "shellcheck"             # Shell script linter

# =============================================================================
# Programming Languages
# =============================================================================

# Node.js
brew "fnm"                    # Fast Node Manager

# Python
brew "uv"                     # Fast Python package manager

# Go
brew "goenv"
brew "go"
brew "golangci-lint"

# =============================================================================
# Container & Kubernetes
# =============================================================================

brew "kubectl"
brew "helm"
brew "k9s"
brew "stern"
brew "danielfoehrkn/switch/switch"    # kubeswitch

# =============================================================================
# Cloud CLI
# =============================================================================

brew "awscli"
brew "rclone"
# brew "google-cloud-sdk"     # Uncomment if needed
# brew "azure-cli"            # Uncomment if needed

# =============================================================================
# Cask Applications - Must Have
# =============================================================================

cask "raycast"
cask "1password"
cask "google-chrome"
cask "keepingyouawake"
cask "keka"
cask "appcleaner"

# =============================================================================
# Cask Applications - Development
# =============================================================================

cask "cursor"
cask "visual-studio-code"
cask "warp"
cask "orbstack"
cask "apifox"
cask "proxyman"
cask "sourcetree"

# =============================================================================
# Cask Applications - System Enhancement
# =============================================================================

cask "istat-menus"
cask "coconutbattery"
cask "monitorcontrol"
cask "gas-mask"
cask "balenaetcher"
cask "openinterminal-lite"
cask "openineditor-lite"
cask "qlmarkdown"
cask "syntax-highlight"

# =============================================================================
# Cask Applications - Media
# =============================================================================

cask "iina"
cask "imageoptim"

# =============================================================================
# Cask Applications - Communication
# =============================================================================

cask "lark"                   # Feishu
cask "dingtalk"
cask "wecom"
cask "wechat"
cask "discord"
cask "whatsapp"
cask "slack"
cask "tencent-meeting"

# =============================================================================
# Cask Applications - Productivity
# =============================================================================

cask "notion"

# =============================================================================
# Cask Applications - AI Tools
# =============================================================================

cask "lm-studio"

# =============================================================================
# Fonts
# =============================================================================

cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-inter"
cask "font-noto-sans-cjk-sc"

# =============================================================================
# Optional - Uncomment as needed
# =============================================================================

# cask "neteasemusic"         # Music
# cask "reddit"               # Reddit client
